1-resman stage
terraform plan
```

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_billing_account_iam_member.default["project-factory-dev"] will be destroyed
  # (because key ["project-factory-dev"] is not in for_each map)
  - resource "google_billing_account_iam_member" "default" {
      - billing_account_id = "01C8D5-E4EA95-F2D624" -> null
      - etag               = "BwYvbP7DfIA=" -> null
      - id                 = "01C8D5-E4EA95-F2D624/roles/billing.user/serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member             = "serviceAccount:ten21-dev-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role               = "roles/billing.user" -> null
    }

  # google_billing_account_iam_member.default["project-factory-prod"] will be destroyed
  # (because key ["project-factory-prod"] is not in for_each map)
  - resource "google_billing_account_iam_member" "default" {
      - billing_account_id = "01C8D5-E4EA95-F2D624" -> null
      - etag               = "BwYvbP7DfIA=" -> null
      - id                 = "01C8D5-E4EA95-F2D624/roles/billing.user/serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - member             = "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> null
      - role               = "roles/billing.user" -> null
    }

  # google_billing_account_iam_member.default["sa_net_costs_manager"] will be created
  + resource "google_billing_account_iam_member" "default" {
      + billing_account_id = "01C8D5-E4EA95-F2D624"
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + role               = "roles/billing.costsManager"
    }

  # google_billing_account_iam_member.default["sa_pf_billing"] must be replaced
-/+ resource "google_billing_account_iam_member" "default" {
      ~ etag               = "BwYvbP7DfIA=" -> (known after apply)
      ~ id                 = "01C8D5-E4EA95-F2D624/roles/billing.user/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> (known after apply)
      ~ member             = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.default["sa_pf_costs_manager"] must be replaced
-/+ resource "google_billing_account_iam_member" "default" {
      ~ etag               = "BwYvbP7DfIA=" -> (known after apply)
      ~ id                 = "01C8D5-E4EA95-F2D624/roles/billing.costsManager/serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> (known after apply)
      ~ member             = "serviceAccount:ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" -> "serviceAccount:ten21-prod-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_billing_account_iam_member.default["sa_sec_costs_manager"] will be created
  + resource "google_billing_account_iam_member" "default" {
      + billing_account_id = "01C8D5-E4EA95-F2D624"
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ten21-prod-resman-sec-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + role               = "roles/billing.costsManager"
    }

  # google_storage_bucket_object.providers["2-project-factory"] will be updated in-place
  ~ resource "google_storage_bucket_object" "providers" {
      ~ content             = (sensitive value)
      ~ crc32c              = "AGoRBQ==" -> (known after apply)
      ~ detect_md5hash      = "yHRPfTXK0DyjwHLyhTvAHw==" -> "different hash"
      ~ generation          = 1739891413251762 -> (known after apply)
        id                  = "ten21-prod-iac-core-outputs-0-providers/2-project-factory-providers.tf"
      ~ md5hash             = "yHRPfTXK0DyjwHLyhTvAHw==" -> (known after apply)
        name                = "providers/2-project-factory-providers.tf"
        # (14 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["2-project-factory-r"] will be updated in-place
  ~ resource "google_storage_bucket_object" "providers" {
      ~ content             = (sensitive value)
      ~ crc32c              = "yFiTqQ==" -> (known after apply)
      ~ detect_md5hash      = "R7R5mup9daTE1NGi1dow9w==" -> "different hash"
      ~ generation          = 1739891413548678 -> (known after apply)
        id                  = "ten21-prod-iac-core-outputs-0-providers/2-project-factory-r-providers.tf"
      ~ md5hash             = "R7R5mup9daTE1NGi1dow9w==" -> (known after apply)
        name                = "providers/2-project-factory-r-providers.tf"
        # (14 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["3-project-factory-dev"] will be destroyed
  # (because key ["3-project-factory-dev"] is not in for_each map)
  - resource "google_storage_bucket_object" "providers" {
      - bucket              = "ten21-prod-iac-core-outputs-0" -> null
      - content             = (sensitive value) -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "xVy/Lw==" -> null
      - detect_md5hash      = "mTvqabcTQc5o1NnZis5ipQ==" -> null
      - event_based_hold    = false -> null
      - generation          = 1739891413458326 -> null
      - id                  = "ten21-prod-iac-core-outputs-0-providers/3-project-factory-dev-providers.tf" -> null
      - md5hash             = "mTvqabcTQc5o1NnZis5ipQ==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-dev-providers.tf?generation=1739891413458326&alt=media" -> null
      - metadata            = {} -> null
      - name                = "providers/3-project-factory-dev-providers.tf" -> null
      - output_name         = "providers/3-project-factory-dev-providers.tf" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-dev-providers.tf" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["3-project-factory-dev-r"] will be destroyed
  # (because key ["3-project-factory-dev-r"] is not in for_each map)
  - resource "google_storage_bucket_object" "providers" {
      - bucket              = "ten21-prod-iac-core-outputs-0" -> null
      - content             = (sensitive value) -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "vrw3tw==" -> null
      - detect_md5hash      = "sCMvi4OnPZnErZkH2CGm6Q==" -> null
      - event_based_hold    = false -> null
      - generation          = 1739891413465152 -> null
      - id                  = "ten21-prod-iac-core-outputs-0-providers/3-project-factory-dev-r-providers.tf" -> null
      - md5hash             = "sCMvi4OnPZnErZkH2CGm6Q==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-dev-r-providers.tf?generation=1739891413465152&alt=media" -> null
      - metadata            = {} -> null
      - name                = "providers/3-project-factory-dev-r-providers.tf" -> null
      - output_name         = "providers/3-project-factory-dev-r-providers.tf" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-dev-r-providers.tf" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["3-project-factory-prod"] will be destroyed
  # (because key ["3-project-factory-prod"] is not in for_each map)
  - resource "google_storage_bucket_object" "providers" {
      - bucket              = "ten21-prod-iac-core-outputs-0" -> null
      - content             = (sensitive value) -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "rF/MEQ==" -> null
      - detect_md5hash      = "nyNyvD1Kq+SoQ8QB5q3jkg==" -> null
      - event_based_hold    = false -> null
      - generation          = 1739891413533989 -> null
      - id                  = "ten21-prod-iac-core-outputs-0-providers/3-project-factory-prod-providers.tf" -> null
      - md5hash             = "nyNyvD1Kq+SoQ8QB5q3jkg==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-prod-providers.tf?generation=1739891413533989&alt=media" -> null
      - metadata            = {} -> null
      - name                = "providers/3-project-factory-prod-providers.tf" -> null
      - output_name         = "providers/3-project-factory-prod-providers.tf" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-prod-providers.tf" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.providers["3-project-factory-prod-r"] will be destroyed
  # (because key ["3-project-factory-prod-r"] is not in for_each map)
  - resource "google_storage_bucket_object" "providers" {
      - bucket              = "ten21-prod-iac-core-outputs-0" -> null
      - content             = (sensitive value) -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "EMYj4Q==" -> null
      - detect_md5hash      = "VZ3gEgLbI700wgBh8/p2+g==" -> null
      - event_based_hold    = false -> null
      - generation          = 1739891412959300 -> null
      - id                  = "ten21-prod-iac-core-outputs-0-providers/3-project-factory-prod-r-providers.tf" -> null
      - md5hash             = "VZ3gEgLbI700wgBh8/p2+g==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-prod-r-providers.tf?generation=1739891412959300&alt=media" -> null
      - metadata            = {} -> null
      - name                = "providers/3-project-factory-prod-r-providers.tf" -> null
      - output_name         = "providers/3-project-factory-prod-r-providers.tf" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/ten21-prod-iac-core-outputs-0/o/providers%2F3-project-factory-prod-r-providers.tf" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.tfvars will be updated in-place
  ~ resource "google_storage_bucket_object" "tfvars" {
      ~ content             = (sensitive value)
      ~ detect_md5hash      = "cJ75A/MkFgbKZ/KTvuWq5Q==" -> "different hash"
        id                  = "ten21-prod-iac-core-outputs-0-tfvars/1-resman.auto.tfvars.json"
        name                = "tfvars/1-resman.auto.tfvars.json"
        # (17 unchanged attributes hidden)
    }

  # local_file.providers["1-resman-folder-sandbox"] will be destroyed
  # (because key ["1-resman-folder-sandbox"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-dev-resman-sbox-0"
                impersonate_service_account = "ten21-dev-resman-sbox-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-dev-resman-sbox-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-dev-resman-sbox-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for sandbox
        EOT -> null
      - content_base64sha256 = "+6XYC77fBXbbxkSZCanc3mb4nzQthABF5Ytr8C5rm14=" -> null
      - content_base64sha512 = "hJB5xyL6jxT3BKYFAazQ9EYWKASR36e5E5Z3y43OYDoSJr9k22zZjYyiWd8gTt31ss3WlKc6wejlarvoWuMA2g==" -> null
      - content_md5          = "3c4dfec822a3dc19f55f090ac3e02b4a" -> null
      - content_sha1         = "5562cad6a7a4edd956fe67543dcbc0168ed328d1" -> null
      - content_sha256       = "fba5d80bbedf0576dbc6449909a9dcde66f89f342d840045e58b6bf02e6b9b5e" -> null
      - content_sha512       = "849079c722fa8f14f704a60501acd0f44616280491dfa7b9139677cb8dce603a1226bf64db6cd98d8ca259df204eddf5b2cdd694a73ac1e8e56abbe85ae300da" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/1-resman-folder-sandbox-providers.tf" -> null
      - id                   = "5562cad6a7a4edd956fe67543dcbc0168ed328d1" -> null
    }

  # local_file.providers["2-networking"] will be destroyed
  # (because key ["2-networking"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-net-0"
                impersonate_service_account = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-net-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for networking
        EOT -> null
      - content_base64sha256 = "LjRp7g38drpERqiSHadyuVr8hi62LTVYjUGPTFgSX24=" -> null
      - content_base64sha512 = "kQFkP9681WGehZf/eoRwOvaDcJVnYudq0v1Z1cOveDCpTXcr94hqFD6m2fDgpc28yNOLg4zB0l7Y4a+H6P4TQg==" -> null
      - content_md5          = "d38a0396bcf5773cde58d008453eb94c" -> null
      - content_sha1         = "be39c7a7b2c175975f36b857fec367307770bae0" -> null
      - content_sha256       = "2e3469ee0dfc76ba4446a8921da772b95afc862eb62d35588d418f4c58125f6e" -> null
      - content_sha512       = "9101643fdebcd5619e8597ff7a84703af68370956762e76ad2fd59d5c3af7830a94d772bf7886a143ea6d9f0e0a5cdbcc8d38b838cc1d25ed8e1af87e8fe1342" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-networking-providers.tf" -> null
      - id                   = "be39c7a7b2c175975f36b857fec367307770bae0" -> null
    }

  # local_file.providers["2-networking-r"] will be destroyed
  # (because key ["2-networking-r"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-prod-resman-net-0"
                impersonate_service_account = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-prod-resman-net-0r@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for networking
        EOT -> null
      - content_base64sha256 = "Ud5zmHCsoTRLPNWJQvnpbBSWV7WmXURPsLuptFHsngQ=" -> null
      - content_base64sha512 = "rZr3Yk23NJMEg+JdIo6TFPD2EZZqziEArdc8Qqcb9OZkx1pUnEpMrD1Z21odIBBzFY9iNbsHon10LCzmz5vukg==" -> null
      - content_md5          = "a98c79340e4856fc0103df53134d8847" -> null
      - content_sha1         = "096b3c0b93431efe4be41954f3a9740a4546b83f" -> null
      - content_sha256       = "51de739870aca1344b3cd58942f9e96c149657b5a65d444fb0bba9b451ec9e04" -> null
      - content_sha512       = "ad9af7624db734930483e25d228e9314f0f611966ace2100add73c42a71bf4e664c75a549c4a4cac3d59db5a1d201073158f6235bb07a27d742c2ce6cf9bee92" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-networking-r-providers.tf" -> null
      - id                   = "096b3c0b93431efe4be41954f3a9740a4546b83f" -> null
    }

  # local_file.providers["2-project-factory"] will be destroyed
  # (because key ["2-project-factory"] is not in for_each map)
  - resource "local_file" "providers" {
      - content              = <<-EOT
            /**
             * Copyright 2022 Google LLC
             *
             * Licensed under the Apache License, Version 2.0 (the "License");
             * you may not use this file except in compliance with the License.
             * You may obtain a copy of the License at
             *
             *      http://www.apache.org/licenses/LICENSE-2.0
             *
             * Unless required by applicable law or agreed to in writing, software
             * distributed under the License is distributed on an "AS IS" BASIS,
             * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
             * See the License for the specific language governing permissions and
             * limitations under the License.
             */

            terraform {
              backend "gcs" {
                bucket                      = "ten21-resman-pf-0"
                impersonate_service_account = "ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
              }
            }
            provider "google" {
              impersonate_service_account = "ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }
            provider "google-beta" {
              impersonate_service_account = "ten21-resman-pf-0@ten21-prod-iac-core-0.iam.gserviceaccount.com"
            }

            # end provider.tf for project_factory
        EOT -> null
      - content_base64sha256 = "RKxGxWeussfpbPjqwsxKnnI0Zd95AZNc6Vd33IGmvfs=" -> null
      - content_base64sha512 = "XvszL7wEY1BvkmZYkPFz8e6zMsqniC5v4DLF962wtcdrFc3RGeE47kKrB04UR2GyOfe0H+CNSsfrAngBVotxFA==" -> null
      - content_md5          = "c8744f7d35cad03ca3c072f2853bc01f" -> null
      - content_sha1         = "81e8f48d05a7ecc9429afd668001aedd3a130169" -> null
      - content_sha256       = "44ac46c567aeb2c7e96cf8eac2cc4a9e723465df7901935ce95777dc81a6bdfb" -> null
      - content_sha512       = "5efb332fbc0463506f92665890f173f1eeb332caa7882e6fe032c5f7adb0b5c76b15cdd119e138ee42ab074e144761b239f7b41fe08d4ac7eb027801568b7114" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "../fast-config/providers/2-project-factory-providers.tf" -> null
      - id                   = "81e8f48d05a7ecc9429afd668001aedd3a130169" -> null
    }

```